---
kind: type
id: T:Autodesk.Revit.DB.Structure.BoundaryConditionsType
source: html/8cd53f01-4670-e13b-6431-0260dae7246a.htm
---
# Autodesk.Revit.DB.Structure.BoundaryConditionsType

This enum declares type of BoundaryConditions.

## Syntax (C#)
```csharp
public enum BoundaryConditionsType
```